app/views/home/_question.html.erb

		<br>
		<% if question.answers.length == 0 %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  ORDER BY "answers"."created_at" DESC  [["question_id", 5]]