app/controllers/answers_controller.rb

  def index
    @answers = Answer.all
---
SELECT "answers".* FROM "answers"

  def create
    @answer = Answer.new(answer_params)
    respond_to do |format|
      if @answer.save
---
INSERT INTO "answers" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "nothing much"], ["user_id", 1], ["question_id", 1], ["created_at", "2017-07-16 12:10:09.850543"], ["updated_at", "2017-07-16 12:10:09.850543"]]

    def set_answer
      @answer = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]