app/controllers/home_controller.rb

  def index
   	if current_user==nil && Question.all.length == 0
---
SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC

  def upload_image
  	uploaded_file = params[:image]
  	filename = SecureRandom.hex + "." +uploaded_file.original_filename.split('.')[1]
  	filepath = Dir.pwd + "/public/uploads/" + filename
	File.open(filepath,'wb') do |file|
		file.write(uploaded_file.read())
	end

	current_user.profile_picture = filename
	current_user.save!
---
UPDATE "users" SET "profile_picture" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_picture", "7f9159112cc6a242f100807901458eb2.jpg"], ["updated_at", "2017-07-24 08:18:03.651975"], ["id", 1]]