app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id
    respond_to do |format|

      if @question.save
---
INSERT INTO "questions" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hi, whats your name?"], ["user_id", 1], ["created_at", "2017-07-16 09:16:08.456606"], ["updated_at", "2017-07-16 09:16:08.456606"]]

    def set_question
      @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]