app/controllers/upvote_controller.rb

	def toggle_upvote
		@utype=params[:utype]
		@qa_id=params[:qa_id]
		if @utype == "question"
			@question = Question.find(params[:qa_id])
			upvote = Upvote.where(user_id: current_user.id , qa_id: @qa_id, utype: 'question').first
			if upvote
				upvote.destroy!
				@is_upvote = false

			else
				Upvote.create(user_id: current_user.id, qa_id: @qa_id , utype: 'question')
				@is_upvote = true
			end
		else
			@answer = Answer.find(params[:qa_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "upvotes".* FROM "upvotes" WHERE "upvotes"."user_id" = ? AND "upvotes"."qa_id" = ? AND "upvotes"."type" = ?  ORDER BY "upvotes"."id" ASC LIMIT 1  [["user_id", 1], ["qa_id", 2], ["type", "question"]]
DELETE FROM "upvotes" WHERE "upvotes"."id" = ?  [["id", 1]]
INSERT INTO "upvotes" ("user_id", "qa_id", "utype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["qa_id", 1], ["utype", "answer"], ["created_at", "2017-07-16 21:50:31.356319"], ["updated_at", "2017-07-16 21:50:31.356319"]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]